<template>
  <div class="content-page">
    <h1>Обзор компонента динамической формы</h1>
    <p>
      В этом проекте я представляю компонент динамической формы, который динамически генерирует формы на основе заданной схемы, обеспечивая простую валидацию и обработку данных.
      Компонент позволяет пользователям заполнять формы, не беспокоясь о корректности ввода, благодаря встроенным механизмам проверки.
    </p>

    <h2>Ключевые особенности:</h2>
    <ul>
      <li><strong>Динамическое создание форм:</strong> Формы автоматически создаются на основе конфигурации, что позволяет легко адаптировать их к различным сценариям.</li>
      <li><strong>Валидация данных:</strong> Валидация происходит на клиентской стороне, что обеспечивает удобство для пользователей и минимизирует количество ошибок при отправке.</li>
      <li><strong>Отправка и очистка формы:</strong> После успешной отправки данные отправляются на сервер, и форма очищается для нового ввода.</li>
      <li><strong>Сохранение и восстановление данных:</strong> Данные форм сохраняются в локальном хранилище браузера, что позволяет восстанавливать их после перезагрузки страницы.</li>
      <li><strong>Динамические зависимости:</strong> Реализована логика отображения/скрытия полей на основе значений других полей.</li>
      <li><strong>Навигация по форме:</strong> Организована навигация по форме с клавиатуры с учётом <code>tabIndex</code>.</li>
    </ul>
    <p>
      Этот компонент демонстрирует архитектурные решения, направленные на масштабируемость и поддерживаемость, что делает его удобным для дальнейшей разработки и модификации.
    </p>
    <a href="https://github.com/stroggfaer/vue2_form" target="_blank" class="repo-link">Ссылка на репозиторий</a>
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue';
export default defineComponent({

});
</script>

<style scoped>
  .content-page {
  }

  h1 {
    margin-top: 0px;
    margin-bottom: 20px;
    font-size: 28px;
  }

  h2 {
    margin-top: 20px;
    margin-bottom: 10px;
  }

  p {
    line-height: 1.6;
    margin-bottom: 15px;
  }

  ul {
    margin-bottom: 15px;
    color: #000;
    list-style-type: disc;
    margin-left: 30px;
  }

  li {
    margin-bottom: 10px;
    color: #000;
    font-size: 16px;
  }
</style>
